    const M_names = ["נועם", "דוד", "אורי", "אריאל", "איתן", "יוסף", "איתי", "דניאל", "משה",
                    "איתמר", "עידו", "אברהם", "יאיר", "ינאי","עומרי", "אביתר", "נתן", "ליאור", "עידן",
                     "מתן", "אביב", "שחר", "אופיר", "אייל", "תומר", "יוחנן", "אופק", "דביר", "עוז", "ישראל",
                      "יהודה", "יעקב", "שמואל", "יצחק", "עילאי", "אלי", "חיים", "שמעון", "יהלי", "אור", "מאור",
                       "שי", "אלעד", "רון", "טל", "לביא", "יותם"];
    const F_names = ["יובל", "תמר", "מאיה", "אביגיל", "טליה", "אדל", "שירה", "איילה", "יעל", "שרה", "רוני", "רומי",
                        "חנה", "ליה", "מיכל", "אסתר", "נויה", "הודיה", "רבקה", "אלה", "נועה", "רחל", "אדוה", "חיה",
                         "אגם", "עלמא", "נעמי", "אריאל", "רות","תהל", "נגה", "הילה", "אמה", "עדי", "אפרת", "ליאן",
                          "גאיה", "מעיין", "אמילי", "יהלי", "עופרי", "שקד", "נטע", "מיקה", "הדס", "ליבי", "גילי",
                           "מיכאלה", "אלונה", "ליהי"];
